<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of Greenfoot.</string>
		<key>Identifier</key>
		<string>com.github.ahousseini-recipes.download.Greenfoot</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Greenfoot</string>
			<key>AKY_RECIPE</key>
			<string>greenfoot</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>cask_name</key>
					<string>greenfoot</string>
				</dict>
				<key>Processor</key>
				<string>com.github.ahousseini-recipes.SharedProcessors/HomebrewCaskURL</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>URLDownloader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>archive_path</key>
					<string>%pathname%</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%</string>
					<key>purge_destination</key>
					<true/>
				</dict>
				<key>Processor</key>
				<string>Unarchiver</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>input_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%/Greenfoot 3.6.1/Greenfoot.app</string>
					<key>requirement</key>
					<string>identifier "org.greenfoot" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "5DNSMBAM8L"</string>
				</dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>input_plist_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%/Greenfoot 3.6.1/Greenfoot.app/Contents/Info.plist</string>
					<key>plist_version_key</key>
					<string>CFBundleShortVersionString</string>
				</dict>
				<key>Processor</key>
				<string>Versioner</string>
			</dict>
		</array>
	</dict>
</plist>
