<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of Greenfoot and creates a package.</string>
		<key>Identifier</key>
		<string>com.github.ahousseini-recipes.pkg.Greenfoot</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Greenfoot</string>
			<key>AKY_RECIPE</key>
			<string>greenfoot</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>ParentRecipe</key>
		<string>com.github.ahousseini-recipes.download.Greenfoot</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>app_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%/Greenfoot 3.6.1/Greenfoot.app</string>
				</dict>
				<key>Processor</key>
				<string>AppPkgCreator</string>
			</dict>
		</array>
	</dict>
</plist>
