<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of SynologyAssistant and reads information for aky.</string>
		<key>Identifier</key>
		<string>com.github.ahousseini-recipes.aky.SynologyAssistant</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>SynologyAssistant</string>
			<key>AKY_RECIPE</key>
			<string>synologyassistant</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>re_pattern</key>
					<string>Version: (\d+.\d+-\d+)</string>
					<key>result_output_var_name</key>
					<string>url_version</string>
					<key>url</key>
					<string>https://www.synology.com/en-us/releaseNote/Assistant</string>
				</dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>filename</key>
					<string>%NAME%.dmg</string>
					<key>url</key>
					<string>https://global.download.synology.com/download/Utility/Assistant/%url_version%/Mac/synology-assistant-%url_version%.dmg</string>
				</dict>
				<key>Processor</key>
				<string>URLDownloader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>input_path</key>
					<string>%pathname%/SynologyAssistant.app</string>
					<key>requirement</key>
					<string>identifier "com.synology.DSAssistant" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = X85BAK35Y4</string>
				</dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
			</dict>
		</array>
	</dict>
</plist>
