<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of ESET Endpoint Antivirus, creates a package and reads information for aky.</string>
		<key>Identifier</key>
		<string>com.github.ahousseini-recipes-aky.aky.ESETEndpointAntivirus</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>ESETEndpointAntivirus</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>ParentRecipe</key>
		<string>com.github.jbaker10.pkg.ESETEndpointAntiVirus</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>FlatPkgUnpacker</string>
				<key>Arguments</key>
				<dict>
					<key>flat_pkg_path</key>
					<string>%pathname%/Resources/Installer.pkg</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>PkgPayloadUnpacker</string>
				<key>Arguments</key>
				<dict>
					<key>pkg_payload_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack/esetendpointantivirus.pkg/Payload</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/version_check</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>Versioner</string>
				<key>Arguments</key>
				<dict>
					<key>input_plist_path</key>
					<string>%RECIPE_CACHE_DIR%/version_check/ESET Endpoint Antivirus.app/Contents/Info.plist</string>
					<key>plist_version_key</key>
					<string>CFBundleShortVersionString</string>
				</dict>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>path_list</key>
					<array>
						<string>%RECIPE_CACHE_DIR%/unpack</string>
						<string>%RECIPE_CACHE_DIR%/version_check</string>
					</array>
				</dict>
				<key>Processor</key>
				<string>PathDeleter</string>
			</dict>
		</array>
	</dict>
</plist>
