<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of Wireshark and creates a package.</string>
		<key>Identifier</key>
		<string>com.github.ahousseini-recipes.pkg.Wireshark</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Wireshark</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>ParentRecipe</key>
		<string>com.github.autopkg.cgerke-recipes.download.Wireshark</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkgdirs</key>
					<dict>
				</dict>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/Scripts</string>
				</dict>
				<key>Processor</key>
				<string>PkgRootCreator</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkgdirs</key>
					<dict>
						<key>Applications</key>
						<string>0775</string>
					</dict>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/pkgroot</string>
				</dict>
				<key>Processor</key>
				<string>PkgRootCreator</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>destination_path</key>
					<string>%pkgroot%/Applications/Wireshark.app</string>
					<key>overwrite</key>
					<true/>
					<key>source_path</key>
					<string>%pathname%/Wireshark.app</string>
				</dict>
				<key>Processor</key>
				<string>Copier</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>file_content</key>
					<string>#!/bin/bash
installer -pkg "/Applications/Wireshark.app/Contents/Resources/Extras/Add Wireshark to the system path.pkg" -target /
installer -pkg "/Applications/Wireshark.app/Contents/Resources/Extras/Install ChmodBPF.pkg" -target /
</string>
					<key>file_mode</key>
					<string>0755</string>
					<key>file_path</key>
					<string>%RECIPE_CACHE_DIR%/Scripts/postinstall</string>
				</dict>
				<key>Processor</key>
				<string>FileCreator</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>input_plist_path</key>
					<string>%pathname%/Wireshark.app/Contents/Info.plist</string>
					<key>plist_version_key</key>
					<string>CFBundleShortVersionString</string>
				</dict>
				<key>Processor</key>
				<string>Versioner</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>force_pkg_build</key>
					<false/>
					<key>pkg_request</key>
					<dict>
						<key>chown</key>
						<array>
					</array>
						<key>id</key>
						<string>org.wireshark.Wireshark</string>
						<key>options</key>
						<string>purge_ds_store</string>
						<key>pkgdir</key>
						<string>%RECIPE_CACHE_DIR%</string>
						<key>pkgroot</key>
						<string>%RECIPE_CACHE_DIR%/pkgroot</string>
						<key>pkgtype</key>
						<string>flat</string>
						<key>scripts</key>
						<string>Scripts</string>
						<key>pkgname</key>
						<string>%NAME%-%version%</string>
					</dict>
				</dict>
				<key>Processor</key>
				<string>PkgCreator</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>path_list</key>
					<array>
						<string>%RECIPE_CACHE_DIR%/Scripts</string>
						<string>%RECIPE_CACHE_DIR%/pkgroot</string>
					</array>
				</dict>
				<key>Processor</key>
				<string>PathDeleter</string>
			</dict>
		</array>
	</dict>
</plist>
